stories/notes-and-projects.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<base href="http://kmdouglass.github.io/stories/notes-and-projects.html">
<meta name="description" content="Notes on my various projects">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Notes and Projects | Kyle M. Douglass</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="http://kmdouglass.github.io/stories/notes-and-projects.html">
<!--[if lt IE 9]><![endif]--><meta name="description" itemprop="description" content="Notes on my various projects">
<meta name="author" content="Kyle M. Douglass">
<meta property="og:site_name" content="Kyle M. Douglass">
<meta property="og:title" content="Notes and Projects">
<meta property="og:url" content="http://kmdouglass.github.io/stories/notes-and-projects.html">
<meta property="og:description" content="Notes on my various projects">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2014-12-26T00:00:00+01:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://kmdouglass.github.io/">

                <span id="blog-title">Kyle M. Douglass</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="about-me.html">About</a>
                </li>
<li class="active">
<a href="#">Notes <span class="sr-only">(active)</span></a>
                </li>
<li>
<a href="../posts/index.html">Blog</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="contact.html">Contact</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="notes-and-projects.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Notes and Projects</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Misc. computer notes</h2>
<div class="outline-text-2" id="text-1">
<p>
These are all the notes I've collected so far for getting things
done on computers. I hope they can help you as well.
</p>

<ul class="org-ul">
<li>
<a href="notes/linux.html">Debian Linux</a>
</li>
<li>
<a href="notes/scipy.html">Python for Scientific Applications</a>
</li>
<li>
<a href="notes/nikola.html">Nikola</a>
</li>
<li>
<a href="notes/git.html">Git</a>
</li>
<li>
<a href="notes/cuda.html">CUDA</a>
</li>
<li>
<a href="notes/emacs.html">Emacs</a>
</li>
<li>
<a href="notes/windows.html">Notes on Windows</a>
</li>
</ul>
<hr>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Fiji and Micro-Manager</h2>
<div class="outline-text-2" id="text-2">
<p>
Using and customizing Micro-Manager takes a while to learn. Here are
the notes I have collected along the way.
</p>

<ul class="org-ul">
<li>
<a href="../notes/fiji.html">Fiji programming notes</a>
</li>
<li>
<a href="https://github.com/kmdouglass/Micro-Manager">My Micro-Manager utilities on GitHub</a>
</li>
<li>
<a href="notes/micro-manager.html">Micro-Manager notes</a>
</li>
<li>
<a href="https://www.micro-manager.org/">The Micro-Manager website</a>
</li>
</ul>
<hr>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">pgFocus autofocus module</h2>
<div class="outline-text-2" id="text-3">
<p>
I've tested Karl Bellve's <a href="http://big.umassmed.edu/wiki/index.php/PgFocus">pgFocus</a> open source and open hardware
autofocus module. This module maintains the focus of a microscope
overtime by sending a control signal that adjusts the position of
the microscope objective. The control signal is generated in
response to the displacement of an infrared beam hitting a linear
light sensor array. The beam is reflected off of the coverslip/water
interface.
</p>

<ul class="org-ul">
<li>
<a href="notes/pgFocus.html">Notes on pgFocus</a>
</li>
<li>
<a href="http://big.umassmed.edu/wiki/index.php/PgFocus">Karl Bellve's pgFocus Wiki</a>
</li>
</ul>
<hr>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Setting up OMERO</h2>
<div class="outline-text-2" id="text-4">
<p>
These are my notes on setting up the OMERO client-server software
for microscopy data.
</p>

<ul class="org-ul">
<li>
<a href="notes/omero.html">Notes on OMERO</a>
</li>
<li>
<a href="http://www.openmicroscopy.org/site">The Open Microscopy Environment website</a>
</li>
</ul>
<hr>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">CellProfiler</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>
<a href="notes/cellprofiler.html">CellProfiler notes</a>
</li>
</ul>
<hr>
</div>
</div>
    </div>
    

</article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2016         <a href="mailto:kyle.douglass@epfl.ch">Kyle M. Douglass</a> - Powered by         <a href="http://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
